import { collection, addDoc } from "firebase/firestore";
import { db } from "./firebase.js"; // або твій шлях до firebase.js

const events  = [
    {
      title: "Подія №1",
      urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
      textInfo: [`Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
                 `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
                 `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
      ]
    },
    {
      title: "Подія №2",
      urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
      textInfo: [`Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
                 `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
                 `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
      ]
    },
    {
      title: "Подія №3",
      urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
      textInfo: [`Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
                 `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
                 `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
      ]
    },
    {
      title: "Подія №4",
      urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
      textInfo: [`Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
                 `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
                 `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
      ]
    }, 
    {
      title: "Подія №5",
      urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
      textInfo: [`Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
                 `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
                 `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
      ]
    }

  ];


async function uploadEvents() {
  const eventsCollection = collection(db, "evenstInfo");

  for (const event of events) {
    try {
      await addDoc(eventsCollection, event);
      console.log(`Успішно додано: ${event.title}`);
    } catch (e) {
      console.error("Помилка додавання: ", e);
    }
  }
}

uploadEvents();

// import { db } from './firebase.js'; // Шлях до вашого firebase.js
// import { collection, addDoc } from 'firebase/firestore';

// async function uploadTestsData() {
//   const eventsInfoList = [
//     {
//       title: "Подія №1",
//       urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
//       textInfo: [
//           `Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
//           `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
//           `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
//       ]
//   },
//   {
//       title: "Подія №2",
//       urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
//       textInfo: [
//           `Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
//           `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
//           `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
//       ]
//   },
//   {
//       title: "Подія №3",
//       urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
//       textInfo: [
//           `Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
//           `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
//           `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
//       ]
//   },
//   {
//       title: "Подія №4",
//       urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
//       textInfo: [
//           `Першими християнами в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
//           `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
//           `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
//       ]
//   },
//   {
//       title: "Подія №5",
//       urlImage: 'https://www.istpravda.com.ua/images/doc/9/2/923b987-1.jpg',
//       textInfo: [
//           `Першими християними в Японії, ймовірно, були представники несторіанства — конфесії, поширеної на Сході. Вони потрапили в країну у 13 столітті. Однак поява та поширення організованого християнства на Японських островах почалися з приходом європейців. До 16 століття західний світ майже нічого не знав про Японію.`,
//           `Першими європейцями, що побували в Країні вранішнього сонця, були португальці, які налагодили з нею торговельні зв’язки. Разом з товарами португальці везли з собою релігію, тож уже 1549 року до Японії прибули перші католицькі місіонери, а 1551 року в Хірадо з’явилася перша у країні церква.`,
//           `Тодішній правитель центральної Японії Ода Нобунаґа тепло зустрів західних гостей. Як амбіційна людина він планував почати торгівлю з рештою світу та об’єднати всю Японію під своєю владою. З політичною метою Ода Нобунаґа активно цікавився європейською культурою та прихильно ставився до християн.`
//       ]
//   }
// ];

//     try {
//         const testsCollection = collection(db, 'eventsInfo');

//         for (const test of eventsInfoList) {
//             await addDoc(testsCollection, test);
//             console.log(`Тест "${test.title}" успішно додано до Firestore`);
//         }

//         console.log('Усі тести успішно завантажено до Firestore');
//     } catch (error) {
//         console.error('Помилка при завантаженні тестів:', error);
//         throw error; // Для обробки помилки в компоненті
//     }
// }

// uploadTestsData();